In [1]:
import pandas as pd
import numpy as np

In [7]:
data=pd.read_csv(r"C:\Users\mdfir\Downloads\dowjones.csv")

In [11]:
data.head()

         Date  Price
0  1914-12-01  55.00
1  1915-01-01  56.55
2  1915-02-01  56.00
3  1915-03-01  58.30
4  1915-04-01  66.45

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 649 entries, 0 to 648
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    649 non-null    object
 1   Price   649 non-null    float64
dtypes: float64(1), object(1)
memory usage: 10.3+ KB

In [17]:
data["Date"]=pd.to_datetime(data["Date"])

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 649 entries, 0 to 648
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    649 non-null    datetime64[ns]
 1   Price   649 non-null    float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 10.3 KB

In [21]:
data["date_year"]=data["Date"].dt.year

In [23]:
data.head()

        Date  Price  date_year
0 1914-12-01  55.00       1914
1 1915-01-01  56.55       1915
2 1915-02-01  56.00       1915
3 1915-03-01  58.30       1915
4 1915-04-01  66.45       1915

In [25]:
data["date_day_no"]=data["Date"].dt.day

In [27]:
data.head()

        Date  Price  date_year  date_day_no
0 1914-12-01  55.00       1914            1
1 1915-01-01  56.55       1915            1
2 1915-02-01  56.00       1915            1
3 1915-03-01  58.30       1915            1
4 1915-04-01  66.45       1915            1

In [29]:
data["date_day_name"]=data["Date"].dt.day_name()

In [31]:
data.head()

        Date  Price  date_year  date_day_no date_day_name
0 1914-12-01  55.00       1914            1       Tuesday
1 1915-01-01  56.55       1915            1        Friday
2 1915-02-01  56.00       1915            1        Monday
3 1915-03-01  58.30       1915            1        Monday
4 1915-04-01  66.45       1915            1      Thursday

In [33]:
data["date_month_no"]=data["Date"].dt.month

In [35]:
data.head()

        Date  Price  date_year  date_day_no date_day_name  date_month_no
0 1914-12-01  55.00       1914            1       Tuesday             12
1 1915-01-01  56.55       1915            1        Friday              1
2 1915-02-01  56.00       1915            1        Monday              2
3 1915-03-01  58.30       1915            1        Monday              3
4 1915-04-01  66.45       1915            1      Thursday              4

In [41]:
data["date_month_name"]=data["Date"].dt.month_name()

In [43]:
data.head()

,Date,Price,date_year,date_day_no,date_day_name,date_month_no,date_month_name
0,1914-12-01,55.00,1914,1,Tuesday,12,December
1,1915-01-01,56.55,1915,1,Friday,1,January
2,1915-02-01,56.00,1915,1,Monday,2,February
3,1915-03-01,58.30,1915,1,Monday,3,March
4,1915-04-01,66.45,1915,1,Thursday,4,April

In [55]:
data["Price"].astype("float64")

0       55.00
1       56.55
2       56.00
3       58.30
4       66.45
        ...
644    883.72
645    922.80
646    955.47
647    964.12
648    965.39
Name: Price, Length: 649, dtype: float64

In [57]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 649 entries, 0 to 648
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date             649 non-null    datetime64[ns]
 1   Price            649 non-null    float64
 2   date_year        649 non-null    int32
 3   date_day_no      649 non-null    int32
 4   date_day_name    649 non-null    object
 5   date_month_no    649 non-null    int32
 6   date_month_name  649 non-null    object
dtypes: datetime64[ns](1), float64(1), int32(3), object(2)
memory usage: 28.0+ KB